name: "ensemble"
platform: "ensemble"
max_batch_size: 0
input[
{
    name: "pf"
    data_type: TYPE_FP32
    dims: [-1, 30, 22]
},
{
    name: "pf_reg"
    data_type: TYPE_FP32
    dims: [-1, 30, 10]
},
{
    name: "sv"
    data_type: TYPE_FP32
    dims: [-1, 5, 13]
},
{
    name: "muon"
    data_type: TYPE_FP32
    dims: [-1, 2, 16]
},
{
    name: "elec"
    data_type: TYPE_FP32
    dims: [-1, 2, 20]
},
{
    name: "tau"
    data_type: TYPE_FP32
    dims: [-1, 3, 18]
},
{
    name: "evt_z"
    data_type: TYPE_FP32
    dims: [-1, 11]
},
{
    name: "evt_reg"
    data_type: TYPE_FP32
    dims: [-1, 12]
}]
output[
{
    name: "hadhad"
    data_type: TYPE_FP32
    dims: [-1, 3]
},
{
    name: "hadmu"
    data_type: TYPE_FP32
    dims: [-1, 1]
},
{
    name: "hadel"
    data_type: TYPE_FP32
    dims: [-1, 1]
},
{
    name: "MassReg_hadhad"
    data_type: TYPE_FP32
    dims: [-1, 2]
},
{
    name: "MassReg_hadmu"
    data_type: TYPE_FP32
    dims: [-1, 2]
},
{
    name: "MassReg_hadel"
    data_type: TYPE_FP32
    dims: [-1, 2]
},
{
    name: "Ztag_Zee_Zhe"
    data_type: TYPE_FP32
    dims: [-1, 1]
},
{
    name: "Ztag_Zmm_Zhm"
    data_type: TYPE_FP32
    dims: [-1, 3]
}]
ensemble_scheduling{
    step[
    {
        model_name: 'hadhad'
        model_version: -1
        input_map {
            key: "inputParticle"
            value: "pf"
        }
        input_map {
            key: "inputSV"
            value: "sv"
        }
        input_map {
            key: "inputEvent"
            value: "evt_z"
        }
        input_map {
            key: "inputTau"
            value: "tau"
        }
        output_map {
            key: "output"
            value: "hadhad"
        }
    },
    {
        model_name: 'hadel'
        model_version: -1
        input_map {
            key: "inputParticle"
            value: "pf"
        }
        input_map {
            key: "inputEl"
            value: "elec"
        }
        input_map {
            key: "inputSV"
            value: "sv"
        }
        input_map {
            key: "inputEvent"
            value: "evt_z"
        }
        input_map {
            key: "inputTau"
            value: "tau"
        }
        output_map {
            key: "output"
            value: "hadel"
        }
    },
    {
        model_name: 'hadmu'
        model_version: -1
        input_map {
            key: "inputParticle"
            value: "pf"
        }
        input_map {
            key: "inputMu"
            value: "muon"
        }
        input_map {
            key: "inputSV"
            value: "sv"
        }
        input_map {
            key: "inputEvent"
            value: "evt_z"
        }
        input_map {
            key: "inputTau"
            value: "tau"
        }
        output_map {
            key: "output"
            value: "hadmu"
        }
    },
    {
        model_name: 'MassReg_hadhad'
        model_version: -1
        input_map {
            key: "inputParticle"
            value: "pf_reg"
        }
        input_map {
            key: "inputSV"
            value: "sv"
        }
        input_map {
            key: "inputEvent"
            value: "evt_reg"
        }
        output_map {
            key: "output"
            value: "MassReg_hadhad"
        }
    },
    {
        model_name: 'MassReg_hadel'
        model_version: -1
        input_map {
            key: "inputParticle"
            value: "pf_reg"
        }
        input_map {
            key: "inputSV"
            value: "sv"
        }
        input_map {
            key: "inputEvent"
            value: "evt_reg"
        }
        output_map {
            key: "output"
            value: "MassReg_hadel"
        }
    },
    {
        model_name: 'MassReg_hadmu'
        model_version: -1
        input_map {
            key: "inputParticle"
            value: "pf_reg"
        }
        input_map {
            key: "inputSV"
            value: "sv"
        }
        input_map {
            key: "inputEvent"
            value: "evt_reg"
        }
        output_map {
            key: "output"
            value: "MassReg_hadmu"
        }
    },
    {
        model_name: 'Ztag_Zee_Zhe'
        model_version: -1
        input_map {
            key: "inputParticle"
            value: "pf"
        }
        input_map {
            key: "inputSV"
            value: "sv"
        }
        input_map {
            key: "inputEvent"
            value: "evt_z"
        }
        input_map {
            key: "inputTau"
            value: "tau"
        }
        input_map {
            key: "inputEl"
            value: "elec"
        }
        output_map {
            key: "output"
            value: "Ztag_Zee_Zhe"
        }
    },
    {
        model_name: 'Ztag_Zmm_Zhm'
        model_version: -1
        input_map {
            key: "inputParticle"
            value: "pf"
        }
        input_map {
            key: "inputSV"
            value: "sv"
        }
        input_map {
            key: "inputEvent"
            value: "evt_z"
        }
        input_map {
            key: "inputTau"
            value: "tau"
        }
        input_map {
            key: "inputMu"
            value: "muon"
        }
        output_map {
            key: "output"
            value: "Ztag_Zmm_Zhm"
        }
    }
]}
